{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_17", "layers": [{"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 2, 3], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["input_13", 0, 0, {"training": 1}]]]}], "input_layers": [["input_13", 0, 0]], "output_layers": [["batch_normalization_13", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_13/gamma", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [3], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [3], "dtype": "float32"}]}]}